adm/app/Models/CandidatosModel.php

SELECT `c`.`pk_id_cadastrado`, `c`.`ds_nome`, `c`.`ds_cpf`, `c`.`ds_data_cadastro`, `c`.`ds_hora_cadastro`, `c`.`ds_nascimento`, `c`.`ds_email`, `c`.`ds_celular`, `p`.`fk_id_edital`, `p`.`fk_id_cargo`, `p`.`ds_protocolo`, `e`.`ds_numero_edital`, `cg`.`pk_id_cargo`, `cg`.`ds_nome_cargo`
FROM `tb_cadastrados` AS `c`
INNER JOIN `tb_cadastrados_protocolo` AS `p` ON `c`.`pk_id_cadastrado` = `p`.`fk_id_cadastrado`
INNER JOIN `tb_cargos` AS `cg` ON `cg`.`pk_id_cargo` = `p`.`fk_id_cargo`
JOIN `tb_editais` as `e` ON `e`.`pk_id_edital` = `p`.`fk_id_edital`
WHERE `p`.`fk_id_edital` = '23'
AND `p`.`fk_id_cargo` = '16'
ORDER BY `c`.`ds_nome` ASC
---
    public function getCandidatosPorEditalCargo($idEdital, $idCargo){
        return $this->db->table('tb_cadastrados AS c')
        ->select([
            'c.pk_id_cadastrado',
            'c.ds_nome',
            'c.ds_cpf',
            'c.ds_data_cadastro',
            'c.ds_hora_cadastro',
            'c.ds_nascimento',
            'c.ds_email',
            'c.ds_celular',
            'p.fk_id_edital',
            'p.fk_id_cargo',
            'p.ds_protocolo',
            'e.ds_numero_edital',
            'cg.pk_id_cargo',
            'cg.ds_nome_cargo'
        ])
        ->join(
            'tb_cadastrados_protocolo AS p',
            'c.pk_id_cadastrado = p.fk_id_cadastrado',
            'inner'
        )
        ->join(
            'tb_cargos AS cg',
            'cg.pk_id_cargo = p.fk_id_cargo',
            'inner'
        )
        ->join('tb_editais as e', 'e.pk_id_edital = p.fk_id_edital')

        ->where('p.fk_id_edital', $idEdital)
        ->where('p.fk_id_cargo', $idCargo)
        ->orderBy('c.ds_nome', 'ASC')
        ->get()
        ->getResult();

SELECT `exp`.`fk_id_experiencia`, `exp`.`ds_quantidade`, `exp`.`ds_multiplicador`, `e`.`ds_nome_experiencia`, `e`.`ds_tipo_experiencia`
FROM `tb_cadastrados_experiencias` `exp`
JOIN `tb_experiencias` `e` ON `e`.`pk_id_experiencia` = `exp`.`fk_id_experiencia`
WHERE `exp`.`fk_id_cadastrado` = '2887'
AND `exp`.`fk_id_edital` = '23'
AND `exp`.`fk_id_cargo` = '16'
---
    public function listarExperienciaCandidato($edital,$cargo,$id){
        return $this->db->table('tb_cadastrados_experiencias exp')
        ->select("
            exp.fk_id_experiencia,
            exp.ds_quantidade,
            exp.ds_multiplicador,
            e.ds_nome_experiencia,
            e.ds_tipo_experiencia
        ")
        ->join(
            'tb_experiencias e',
            'e.pk_id_experiencia = exp.fk_id_experiencia'
        )
        ->where('exp.fk_id_cadastrado', $id)
        ->where('exp.fk_id_edital', $edital)
        ->where('exp.fk_id_cargo', $cargo)
        ->get()
        ->getResult();

SELECT `ce`.`fk_id_escolaridade`, `ce`.`ds_quantidade`, `ce`.`ds_multiplicador`, `e`.`ds_nome_escolaridade`
FROM `tb_cadastrados_escolaridades` `ce`
JOIN `tb_escolaridades` `e` ON `e`.`pk_id_escolaridade` = `ce`.`fk_id_escolaridade`
WHERE `ce`.`fk_id_cadastrado` = '2887'
AND `ce`.`fk_id_edital` = '23'
AND `ce`.`fk_id_cargo` = '16'
---
    public function listarEscolaridadeCandidato($edital,$cargo,$id){
        return $this->db->table('tb_cadastrados_escolaridades ce')
        ->select("
            ce.fk_id_escolaridade,
            ce.ds_quantidade,
            ce.ds_multiplicador,
            e.ds_nome_escolaridade
        ")
        ->join(
            'tb_escolaridades e',
            'e.pk_id_escolaridade = ce.fk_id_escolaridade'
        )
        ->where('ce.fk_id_cadastrado', $id)
        ->where('ce.fk_id_edital', $edital)
        ->where('ce.fk_id_cargo', $cargo)
        ->get()
        ->getResult();

SELECT `ap`.`fk_id_curso`, `ap`.`ds_quantidade`, `ap`.`ds_multiplicador`, `ca`.`ds_nome_curso`
FROM `tb_cadastrados_aperfeicoamentos` `ap`
JOIN `tb_cursos_aperfeicoamentos` `ca` ON `ca`.`pk_id_curso` = `ap`.`fk_id_curso`
WHERE `ap`.`fk_id_cadastrado` = '2887'
AND `ap`.`fk_id_edital` = '23'
AND `ap`.`fk_id_cargo` = '16'
---
    public function listarAperfeicoamentoCandidato($edital,$cargo,$id){
        return $this->db->table('tb_cadastrados_aperfeicoamentos ap')
       ->select("
            ap.fk_id_curso,
            ap.ds_quantidade,
            ap.ds_multiplicador,
            ca.ds_nome_curso
        ")
        ->join(
            'tb_cursos_aperfeicoamentos ca',
            'ca.pk_id_curso = ap.fk_id_curso'
        )
        ->where('ap.fk_id_cadastrado', $id)
        ->where('ap.fk_id_edital', $edital)
        ->where('ap.fk_id_cargo', $cargo)
        ->get()
        ->getResult();