adm/app/Models/CargosExperienciasModel.php

SELECT `tb_cargos_experiencias_editais`.*, `tb_experiencias`.`ds_nome_experiencia`
FROM `tb_cargos_experiencias_editais`
JOIN `tb_experiencias` ON `tb_experiencias`.`pk_id_experiencia` = `tb_cargos_experiencias_editais`.`fk_id_experiencia`
WHERE `tb_cargos_experiencias_editais`.`fk_id_cargo` = '17'
ORDER BY `tb_experiencias`.`ds_nome_experiencia` ASC
---
    public function listarExperienciasDoCargo($idCargo){
        return $this->db->table('tb_cargos_experiencias_editais')
            ->select([
                'tb_cargos_experiencias_editais.*',
                'tb_experiencias.ds_nome_experiencia',
            ])
            ->join('tb_experiencias', 'tb_experiencias.pk_id_experiencia = tb_cargos_experiencias_editais.fk_id_experiencia')
            ->where('tb_cargos_experiencias_editais.fk_id_cargo', $idCargo)
            ->orderBy('tb_experiencias.ds_nome_experiencia', 'ASC')
            ->get()
            ->getResult();