adm/app/Models/CargosModel.php

SELECT *
FROM `tb_cargos`
WHERE `pk_id_cargo` = '16'
 LIMIT 1
---
    public function getCargo($id){
        return $this->where('pk_id_cargo', $id)->first();