adm/app/Models/ClassificacaoModel.php

    public function listarClassificacao($idEdital, $idCargo)
    {
        $classificacoes = $this->db->table($this->table)
            ->select('*')
            ->where('fk_id_edital', $idEdital)
            ->where('fk_id_cargo', $idCargo)
            ->orderBy('ds_posicao', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tb_classificacao`
WHERE `fk_id_edital` = '23'
AND `fk_id_cargo` = '16'
ORDER BY `ds_posicao` ASC