adm/app/Models/EditaisModel.php

SELECT `tb_cargos`.*
FROM `tb_editais_cargos`
JOIN `tb_cargos` ON `tb_cargos`.`pk_id_cargo` = `tb_editais_cargos`.`fk_id_cargo`
WHERE `tb_editais_cargos`.`fk_id_edital` = 23
---
   public function getCargosByEdital(int $idEdital): array
{
    return $this->db->table('tb_editais_cargos')
        ->select('tb_cargos.*')
        ->join('tb_cargos', 'tb_cargos.pk_id_cargo = tb_editais_cargos.fk_id_cargo')
        ->where('tb_editais_cargos.fk_id_edital', $idEdital)
        ->get()
        ->getResult() ?? [];