adm/app/Models/ExperienciasModel.php

    public function listarExperienciasOrdenadas(){
        return $this->orderBy('ds_nome_experiencia', 'ASC')->findAll();
---
SELECT *
FROM `tb_experiencias`
ORDER BY `ds_nome_experiencia` ASC