adm/app/Controllers/Candidatos.php

SELECT *
FROM `tb_cargos`
WHERE `pk_id_cargo` = '16'
 LIMIT 1
---
    public function formSituacaoCandidato($edital,$cargo,$id, $camada1 = 'pages', $camada2 = 'candidatos', $page = 'FormSituacaoCandidato'){
        if (!is_file(APPPATH . 'Views/' . $camada1 . '/' . $camada2 . '/' . $page . '_view.php')) {
            throw new PageNotFoundException("Página não encontrada: " . $page);
        }
        if (!checklogged()) {
            return redirect()->route('home')->with('error','Sua sessão expirou');
        }

        $candidatosService = new CandidatosService();
        $dadosCandidato = $candidatosService->listarCandidatoId($edital,$cargo,$id);
        if(!$dadosCandidato){
            return redirect()->back()->with('error', 'Candidato não encontrado.');
        }

        $nomeCandidato = $dadosCandidato["candidato"]->ds_nome;
        $idCandidato = $dadosCandidato["idCandidato"];
        $idEdital = $dadosCandidato["idEdital"];
        $idCargo = $dadosCandidato["idCargo"];
        $cargosModel = new CargosModel();
        $nomeCargo = $cargosModel->where('pk_id_cargo', $idCargo)->first()->ds_nome_cargo;