adm/app/Controllers/Cargos.php

    public function __construct(){
        $modelCargos = new CargosModel();

        $this->cargosData = [
           'cargos' => $modelCargos->orderBy('ds_nome_cargo', 'asc')->findAll(),
        ];
---
SELECT *
FROM `tb_cargos`
ORDER BY `ds_nome_cargo` ASC