adm/app/Controllers/Dashboard.php

    public function index($camada1 = '', $camada2 = 'pages', $page = 'Dashboard'){
        if (! is_file(APPPATH . 'Views/'.$camada1.'/'.$camada2.'/'. $page . '_view.php')) {
            // Página não encontrada!
            throw new PageNotFoundException("página não econtrada: ".$page);
        }
        if(!checklogged()){
            return redirect()->route('home')->with('error','Sua sessão expirou');
        }

          /*  $contratoService = new ContratoService(
                new DadosContratosModel(),
                new VagasModel(),
                new LogsService(),
                new DadosRescisaoModel(),
                new DadosAditivosModel(),
                new ConvocadosModel(),
                new VerificadorModel()
            );
            // Dispara a verificação automática
            //////$contratoService->verificarContratosVencidos();

        ////$dadosContratos = new DadosContratosModel();
        ////$contratosExpirando = $dadosContratos->getContratosExpirando(30);
        /*if(!$contratosExpirando){
            $contratosExpirando = [];
        }*/

        $modelEditais = new EditaisModel();
        $editaisAtivos = $modelEditais->where('ds_status','1')->findAll();
---
SELECT *
FROM `tb_editais`
WHERE `ds_status` = '1'