adm/app/Controllers/Editais.php

SELECT *
FROM `tb_cargos`
ORDER BY `ds_nome_cargo` ASC
---
    public function __construct(){
        $modelCargos = new CargosModel();

        $modelEditais = new EditaisModel();

        $this->editaisData = [
           'cargos'         => $modelCargos->orderBy('ds_nome_cargo', 'asc')->findAll(),


        ];

SELECT *
FROM `tb_editais`
WHERE `ds_status` = '1'
---
    public function editaisAtivos(){
        $modelEditais = new EditaisModel();
        $editaisAtivos = $modelEditais->where('ds_status','1')->findAll();