app/Services/Transparencia/TransparenciaFormService.php

    public function listarClassificacao(): array
    {
        $params = [
            'page'     => (int) $this->request->getGet('page') ?: 1,
            'per_page' => (int) $this->request->getGet('per_page') ?: 10,
            'search'   => trim((string) $this->request->getGet('search')),
            'cargo'    => (int) $this->request->getGet('cargo'),
            'edital'   => (int) $this->request->getGet('edital'),
        ];

        $service = new TransparenciaService(
            Database::connect(),
            $this->cargosModel,
            $this->editaisModel
        );

        $cargos = $this->cargosModel->cargosEditaisAtivos();

        $editais = $this->editaisModel
            ->orderBy('pk_id_edital', 'DESC')
            ->findAll();
---
SELECT *
FROM `tb_editais`
ORDER BY `pk_id_edital` DESC