app/Services/Transparencia/TransparenciaService.php

    public function listarClassificacao(array $params): array
    {
        $pagina    = max(1, (int) ($params['page'] ?? 1));
        $porPagina = max(1, (int) ($params['per_page'] ?? 10));
        $cargo     = (int) ($params['cargo'] ?? 0);
        $edital    = (int) ($params['edital'] ?? 0);
        $busca     = trim((string) ($params['search'] ?? ''));

        $builder = $this->db->table('tb_classificacao c');
        $builder->select('c.ds_posicao, c.ds_nome_candidato, c.ds_nome_cargo, c.fk_id_edital,c.ds_nome_edital, c.dt_nascimento, c.nr_total_pontos, c.nr_total_experiencias, c.nr_total_graduacao, c.nr_total_posgraduacao, c.nr_total_aperfeicoamentos, c.fk_id_candidato, c.ds_possui_pne, sc.situacao');
        $builder->join('tb_situacao_candidato sc', 'sc.fk_id_candidato = c.fk_id_candidato AND sc.fk_id_cargo = c.fk_id_cargo AND sc.fk_id_edital = c.fk_id_edital', 'left');

        if ($cargo > 0) {
            $builder->where('c.fk_id_cargo', $cargo);
        }

        if ($edital > 0) {
            $builder->where('c.fk_id_edital', $edital);
        }

        if ($busca !== '') {
            $builder->like('c.ds_nome_candidato', $busca);
        }

        $total = $builder->countAllResults(false);

        $dados = $builder
            ->orderBy('c.ds_posicao', 'ASC')
            ->limit($porPagina, ($pagina - 1) * $porPagina)
            ->get()
            ->getResult();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_classificacao` `c`
LEFT JOIN `tb_situacao_candidato` `sc` ON `sc`.`fk_id_candidato` = `c`.`fk_id_candidato` AND `sc`.`fk_id_cargo` = `c`.`fk_id_cargo` AND `sc`.`fk_id_edital` = `c`.`fk_id_edital`
SELECT `c`.`ds_posicao`, `c`.`ds_nome_candidato`, `c`.`ds_nome_cargo`, `c`.`fk_id_edital`, `c`.`ds_nome_edital`, `c`.`dt_nascimento`, `c`.`nr_total_pontos`, `c`.`nr_total_experiencias`, `c`.`nr_total_graduacao`, `c`.`nr_total_posgraduacao`, `c`.`nr_total_aperfeicoamentos`, `c`.`fk_id_candidato`, `c`.`ds_possui_pne`, `sc`.`situacao`
FROM `tb_classificacao` `c`
LEFT JOIN `tb_situacao_candidato` `sc` ON `sc`.`fk_id_candidato` = `c`.`fk_id_candidato` AND `sc`.`fk_id_cargo` = `c`.`fk_id_cargo` AND `sc`.`fk_id_edital` = `c`.`fk_id_edital`
ORDER BY `c`.`ds_posicao` ASC
 LIMIT 10