app/Models/CargosModel.php

SELECT `tb_cargos`.*
FROM `tb_cargos`
JOIN `tb_editais_cargos` ON `tb_editais_cargos`.`fk_id_cargo` = `tb_cargos`.`pk_id_cargo`
JOIN `tb_editais` ON `tb_editais`.`pk_id_edital` = `tb_editais_cargos`.`fk_id_edital`
WHERE `tb_editais`.`ds_status` = '1'
GROUP BY `tb_cargos`.`pk_id_cargo`
ORDER BY `tb_cargos`.`ds_nome_cargo` ASC
---
    public function cargosEditaisAtivos()
    {
        return $this->select('tb_cargos.*')
            ->join('tb_editais_cargos', 'tb_editais_cargos.fk_id_cargo = tb_cargos.pk_id_cargo')
            ->join('tb_editais', 'tb_editais.pk_id_edital = tb_editais_cargos.fk_id_edital')
            ->where('tb_editais.ds_status', '1')
            ->groupBy('tb_cargos.pk_id_cargo')
            ->orderBy('tb_cargos.ds_nome_cargo', 'ASC')
            ->findAll();