app/Models/EditaisCargosModel.php

    public function getEditaisAtivosCargos()
{
    return $this->select('tb_editais_cargos.*, tb_editais.*, tb_cargos.*')
        ->join('tb_editais', 'tb_editais.pk_id_edital = tb_editais_cargos.fk_id_edital')
        ->join('tb_cargos', 'tb_cargos.pk_id_cargo = tb_editais_cargos.fk_id_cargo')

        ->where('tb_editais.ds_status', '1')

        ->groupStart()
            ->where("EXISTS (
                SELECT 1 FROM tb_cargos_experiencias e
                WHERE e.fk_id_cargo = tb_editais_cargos.fk_id_cargo
            )", null, false)

            ->orWhere("EXISTS (
                SELECT 1 FROM tb_cargos_aperfeicoamentos a
                WHERE a.fk_id_cargo = tb_editais_cargos.fk_id_cargo
            )", null, false)

            ->orWhere("EXISTS (
                SELECT 1 FROM tb_cargos_escolaridades s
                WHERE s.fk_id_cargo = tb_editais_cargos.fk_id_cargo
            )", null, false)

            ->orWhere("EXISTS (
                SELECT 1 FROM tb_cargos_criterios_adicionais c
                WHERE c.fk_id_cargo = tb_editais_cargos.fk_id_cargo
            )", null, false)
        ->groupEnd()

        ->orderBy('tb_editais.ds_data_inicial', 'DESC')
        ->findAll();
---
SELECT `tb_editais_cargos`.*, `tb_editais`.*, `tb_cargos`.*
FROM `tb_editais_cargos`
JOIN `tb_editais` ON `tb_editais`.`pk_id_edital` = `tb_editais_cargos`.`fk_id_edital`
JOIN `tb_cargos` ON `tb_cargos`.`pk_id_cargo` = `tb_editais_cargos`.`fk_id_cargo`
WHERE `tb_editais`.`ds_status` = '1'
AND   (
EXISTS (
                SELECT 1 FROM tb_cargos_experiencias_editais e
                WHERE e.fk_id_cargo = tb_editais_cargos.fk_id_cargo
            )
OR EXISTS (
                SELECT 1 FROM tb_cargos_aperfeicoamentos_editais a
                WHERE a.fk_id_cargo = tb_editais_cargos.fk_id_cargo
            )
OR EXISTS (
                SELECT 1 FROM tb_cargos_escolaridades_editais s
                WHERE s.fk_id_cargo = tb_editais_cargos.fk_id_cargo
            )
 )
ORDER BY `tb_editais`.`ds_data_inicial` DESC